export const data = JSON.parse("{\"key\":\"v-60772d2a\",\"path\":\"/docs/IP%E5%9C%B0%E5%9D%800.0.0.0%E6%98%AF%E4%BB%80%E4%B9%88%E6%84%8F%E6%80%9D%EF%BC%9F.html\",\"title\":\"IP地址0.0.0.0是什么意思？\",\"lang\":\"zh-CN\",\"frontmatter\":{\"title\":\"IP地址0.0.0.0是什么意思？\",\"date\":\"2022-05-09T00:27:15.000Z\",\"tags\":[\"网络拾遗\"],\"description\":\"IP地址 0.0.0.0 是什么意思 作用 IPV4中，0.0.0.0地址被用于表示一个无效的，未知的或者不可用的目标。 在服务器中，0.0.0.0指的是本机上的所有IPV4地址，如果一个主机有两个IP地址，192.168.1.1 和 10.1.2.1，并且该主机上的一个服务监听的地址是0.0.0.0 和端口 8080,那么通过这两个&lt;ip地址:8080&gt;都能够访问该服务。 在路由中，0.0.0.0表示的是默认路由，即当路由表中没有找到完全匹配的路由的时候所对应的路由。 用途总结 当一台主机还没有被分配一个IP地址的时候，用于表示主机本身。（DHCP分配IP地址的时候） 用作默认路由，表示”任意IPV4主机”。 用来表示目标机器不可用。 用作服务端，表示本机上的任意IPV4地址。 网关地址 0.0.0.0 表示直连规则，即当前记录对应的 Destination 跟本机在同一个网段，通信时不需要经过网关(路由器)。也就是说使用二层交换机通过MAC即可通信。\"},\"headers\":[{\"level\":2,\"title\":\"作用\",\"slug\":\"作用\",\"link\":\"#作用\",\"children\":[]},{\"level\":2,\"title\":\"用途总结\",\"slug\":\"用途总结\",\"link\":\"#用途总结\",\"children\":[]}],\"readingTime\":{\"minutes\":1.2,\"words\":361},\"filePathRelative\":\"docs/IP地址0.0.0.0是什么意思？.md\",\"localizedDate\":\"2022年5月9日\",\"excerpt\":\"<h1> IP地址 0.0.0.0 是什么意思</h1>\\n<h2> 作用</h2>\\n<p>IPV4中，0.0.0.0地址被用于表示一个无效的，未知的或者不可用的目标。</p>\\n<p>在服务器中，0.0.0.0指的是本机上的所有IPV4地址，如果一个主机有两个IP地址，192.168.1.1 和 10.1.2.1，并且该主机上的一个服务监听的地址是0.0.0.0 和端口 8080,那么通过这两个&lt;ip地址:8080&gt;都能够访问该服务。\\n在路由中，0.0.0.0表示的是默认路由，即当路由表中没有找到完全匹配的路由的时候所对应的路由。</p>\\n<h2> 用途总结</h2>\\n<p>当一台主机还没有被分配一个IP地址的时候，用于表示主机本身。（DHCP分配IP地址的时候）\\n用作默认路由，表示”任意IPV4主机”。\\n用来表示目标机器不可用。\\n用作服务端，表示本机上的任意IPV4地址。\\n网关地址 0.0.0.0 表示直连规则，即当前记录对应的 Destination 跟本机在同一个网段，通信时不需要经过网关(路由器)。也就是说使用二层交换机通过MAC即可通信。</p>\",\"autoDesc\":true}")

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
